In [21]:
# Data Management/Investigation
import warnings
warnings.filterwarnings("ignore")
import pandas as pd
import numpy as np
import missingno as miss
from plotnine import ggplot, geom_histogram, facet_wrap, theme_minimal, theme, geom_boxplot, scale_x_discrete, labs, coord_flip, geom_point, geom_abline, theme_bw, aes
import country_converter as coco

# For pre-processing data
from sklearn import preprocessing as pp
from sklearn.compose import ColumnTransformer

# For splits and CV
from sklearn.model_selection import KFold # Cross validation
from sklearn.model_selection import cross_validate # Cross validation
from sklearn.model_selection import GridSearchCV # Cross validation + param. tuning.

# Machine learning methods
from sklearn.linear_model import LinearRegression as LM
from sklearn.neighbors import KNeighborsRegressor as KNN
from sklearn.tree import DecisionTreeRegressor as DTree
from sklearn.ensemble import BaggingRegressor as Bag
from sklearn.ensemble import RandomForestRegressor as RF

# For evaluating our model's performance
import sklearn.metrics as m

# Pipeline to combine modeling elements
from sklearn.pipeline import Pipeline

In [22]:
#Importing 2003 fractionalization dataset & dropping 5 rows
maam = pd.read_excel(r'Datasets/2003_fractionalization.xls').drop([0,1,217,218,219])

#Renaming the columns
maam.columns = ['Country', 'Source (Ethnicity Data)', 'Date (Ethnicity Data)', 'Ethnic', 'Language', 'Religion']

#Dropped specific columns
maam = maam.drop(columns = ['Source (Ethnicity Data)', 'Date (Ethnicity Data)', 'Ethnic', 'Religion']).reset_index(drop = True)

In [23]:
maam

                   Country   Language
0              Afghanistan   0.614146
1                  Albania  0.0399248
2                  Algeria   0.442662
3           American Samoa   0.173254
4                  Andorra   0.684785
..                     ...        ...
210              West Bank   0.143801
211                  Yemen  0.0079817
212  Yugoslavia (pre 1991)   0.405007
213                 Zambia   0.873408
214               Zimbabwe   0.447227

[215 rows x 2 columns]

In [25]:
#Importing 1965 and 1985 fractionalization dataset
sir = pd.read_excel(r'Datasets/fractionalization_2000.xls').drop(columns = [1, 3, 4, 5, 7, 8, 10, 11, 12]).drop([0]).reset_index(drop = True)

#Renaming the columns
sir.columns = ['COUNTRY', 'ELF61', 'ELF85']

Columns 6 and 9 report an ELF Index (for 1961 and 1985, respectively) that uses none of the groupings reported in the sources when data on sub-groups are available.  (For example, it treats separate Native American groups as separate ethnic groups rather than combining these in a catch-all "Indigenous Peoples".  Similarly,  it treats  Hutus and Tutsis as separate ethnic groups rather than grouping these as  Banyarwanda in Rwanda or Barundi in Burundi). In addition, in settler societies of the Western Hemisphere, this index treats racial distinctions within ethnolinguistic groups (Afro-Americans versus White Americans or Afro-Colombians versus Euro-Colombians) as separate ethnic groups.

In [26]:
sir

         COUNTRY  ELF61  ELF85
0            USA  0.501  0.575
1         Canada  0.755  0.769
2        Bahamas  0.226  0.408
3           Cuba  0.639  0.638
4          Haiti  0.014  0.011
..           ...    ...    ...
178  New Zealand  0.373  0.421
179      Vanuatu  0.412   0.34
180      Solomon    NaN  0.954
181         Fiji  0.711  0.684
182        Samoa  0.017  0.036

[183 rows x 3 columns]

In [ ]:
#Created a new list from the first column
un_maam = bit_table.temp_country.tolist()

#Country-converter variable to restrict the set to only the official recognized UN members
cc_UN = coco.CountryConverter(only_UNmember=True)

#Ran cc_UN on 'bit_country' and saved that list as 'UN'
UN = cc_UN.convert(bit_country, to = 'name_short')

#Dropped the 'temp_country' column from the dataframe
bit_table = bit_table.drop(columns = "temp_country")

In [36]:
#Importing 2003 fractionalization dataset & dropping 5 rows
heir = pd.read_excel(r'Datasets/BL2013_F_v2.2.xls').drop(columns = ['Unnamed: 4',
                                                                    'Unnamed: 5', 
                                                                    'Unnamed: 6', 
                                                                    'Unnamed: 7',
                                                                    'Unnamed: 8',
                                                                    'Unnamed: 9',
                                                                    'Unnamed: 10',
                                                                    'Unnamed: 12',
                                                                    'Unnamed: 13',
                                                                    'Unnamed: 14',
                                                                    'Unnamed: 15',
                                                                    'Unnamed: 16'])

#Renaming the columns
heir.columns = ['Country', 'Year', 'Age Group Min', 'Age Group Max', 'Avg. Years of Total Schooling']

#Dropped specific rows
heir = heir.drop(np.arange(13)).reset_index(drop = True)

In [50]:
temp = heir
temp

,Country,Year,Age Group Min,Age Group Max,Avg. Years of Total Schooling
0,Australia,1950,15,19.0,8.54
1,NaN,1950,20,24.0,8.63
2,NaN,1950,25,29.0,8.69
3,NaN,1950,30,34.0,8.16
4,NaN,1950,35,39.0,8.08
...,...,...,...,...,...
30797,NaN,2010,65,69.0,2.55
30798,NaN,2010,70,74.0,2.6
30799,NaN,2010,75,999.0,3.85
30800,NaN,2010,25,999.0,6.69
30801,NaN,2010,15,999.0,7.38

In [47]:
temp.Country

0        Australia
1              NaN
2              NaN
3              NaN
4              NaN
           ...
30797          NaN
30798          NaN
30799          NaN
30800          NaN
30801          NaN
Name: Country, Length: 30802, dtype: object

In [52]:
for x in range(5): 
    if pd.isna(temp.Country[x]) == False:
        country = temp.Country[x]
    else:
        temp.Country.replace(x, country)

In [53]:
temp.replace.Country(NaN, 0)

,Country,Year,Age Group Min,Age Group Max,Avg. Years of Total Schooling
0,Australia,1950,15,19.0,8.54
1,NaN,1950,20,24.0,8.63
2,NaN,1950,25,29.0,8.69
3,NaN,1950,30,34.0,8.16
4,NaN,1950,35,39.0,8.08
...,...,...,...,...,...
30797,NaN,2010,65,69.0,2.55
30798,NaN,2010,70,74.0,2.6
30799,NaN,2010,75,999.0,3.85
30800,NaN,2010,25,999.0,6.69
30801,NaN,2010,15,999.0,7.38

In [ ]:
df[df.isna().any(axis=1)]